app/Controllers/AuthController.php

SELECT *
FROM `usuarios`
WHERE `ativo` = 1
AND   (
`username` = 'admin'
OR `email` = 'admin'
 )
 LIMIT 1
---
    public function login()
    {
        if ($this->request->getMethod() !== 'get' && $this->request->getMethod() !== 'post') {
            return $this->response->setStatusCode(405)->setJSON(['status'=>'error','message'=>'Método não permitido']);
        }

        $login = trim((string)$this->request->getPost('username') ?? $this->request->getPost('login'));
        $password = $this->request->getPost('password');
        $tipo = $this->request->getPost('tipo') ?? null;
        $remember = $this->request->getPost('remember') ? true : false;
        $ip = $this->request->getIPAddress();

        // validação básica
        if (!$login || !$password) {
            return $this->response->setStatusCode(422)->setJSON(['status'=>'error','message'=>'Informe usuário/e-mail e senha.']);
        }

        // bloqueio: checar tentativas
        $failures = $this->attemptModel->recentFailures($login, $this->lockoutMinutes);
        if ($failures >= $this->maxAttempts) {
            return $this->response->setStatusCode(429)->setJSON([
                'status'=>'error',
                'message' => "Muitas tentativas. Aguarde {$this->lockoutMinutes} minutos antes de tentar novamente."
            ]);
        }

        // buscar usuário
        $usuario = $this->usuarioModel->where('ativo',1)
                    ->groupStart()
                      ->where('username', $login)
                      ->orWhere('email', $login)
                    ->groupEnd()
                    ->first();

INSERT INTO `auth_logs` (`usuario_id`, `action`, `ip`, `user_agent`, `meta`, `created_at`) VALUES ('1', 'login_success', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/143.0.0.0 Safari/537.36', NULL, '2026-01-05 17:31:25')
---
    protected function log($action, $userId = null, $ip = null, $meta = null)
    {
        $db = \Config\Database::connect();
        $db->table('auth_logs')->insert([
            'usuario_id' => $userId,
            'action' => $action,
            'ip' => $ip ?? $this->request->getIPAddress(),
            'user_agent' => $this->request->getUserAgent()->getAgentString(),
            'meta' => is_array($meta) ? json_encode($meta) : $meta,
            'created_at' => date('Y-m-d H:i:s'),
        ]);