app/Controllers/ContribuinteController.php

SELECT *
FROM `contribuintes`
---
    public function listar()
    {
        try {
            $contribuintes = $this->contribuinteModel->findAll();

SELECT `a`.`ATI_Codigo` as `atividade_id`, `a`.`ATI_Descricao` as `descricao`
FROM `atividades_contribuintes` as `ac`
JOIN `atividades` `a` ON `a`.`ATI_Codigo` = `ac`.`ATI_Codigo`
WHERE `ac`.`CON_PRE_Codigo` = 1
AND `ac`.`CON_Codigo` = '1145'
SELECT `c`.`CNAE_Codigo` as `cnae_id`, `c`.`CNAE_Numero` as `numero`, `c`.`CNAE_Descricao` as `nome`
FROM `cnaes_contribuintes` as `cc`
JOIN `cnaes` `c` ON `c`.`CNAE_Codigo` = `cc`.`CNAE_Codigo`
WHERE `cc`.`CON_PRE_Codigo` = 1
AND `cc`.`CON_Codigo` = '1145'
---
    public function obter($id = null)
    {
        try {
            $pre = $this->getPrefeituraCodigo();
            if (!$id) return $this->respond(['success' => false, 'message' => 'Cód. contribuinte não informado'], 400);

            $contribuinte = $this->contribuinteModel->findByComposite((int)$pre, (int)$id);
            if (!$contribuinte) {
                return $this->respond(['success' => false, 'message' => 'Contribuinte não encontrado'], 404);
            }

            $db = \Config\Database::connect();

            // Buscar atividades do contribuinte (tabela pivot: atividades_contribuintes)
            $atividades = $db->table('atividades_contribuintes as ac')
                ->join('atividades a', 'a.ATI_Codigo = ac.ATI_Codigo')
                ->where('ac.CON_PRE_Codigo', $pre)
                ->where('ac.CON_Codigo', $id)
                ->select('a.ATI_Codigo as atividade_id, a.ATI_Descricao as descricao')
                ->get()
                ->getResultArray();

            // Buscar CNAEs do contribuinte (tabela pivot: cnaes_contribuintes)
            $cnaes = $db->table('cnaes_contribuintes as cc')
                ->join('cnaes c', 'c.CNAE_Codigo = cc.CNAE_Codigo')
                ->where('cc.CON_PRE_Codigo', $pre)
                ->where('cc.CON_Codigo', $id)
                ->select('c.CNAE_Codigo as cnae_id, c.CNAE_Numero as numero, c.CNAE_Descricao as nome')
                ->get()
                ->getResultArray();

DELETE FROM `atividades_contribuintes`
WHERE `CON_PRE_Codigo` = 1
AND `CON_Codigo` = '1145'
---
    public function editar($id = null)
    {
        try {
            $pre = $this->getPrefeituraCodigo();
            if (!$id) return $this->respond(['success' => false, 'message' => 'Cód. contribuinte não informado'], 400);

            $contribuinte = $this->contribuinteModel->findByComposite((int)$pre, (int)$id);
            if (!$contribuinte) return $this->respond(['success' => false, 'message' => 'Contribuinte não encontrado'], 404);

            $dados = $this->request->getJSON(true);
            log_message('debug', 'Payload editar id=' . var_export($id, true) . ' : ' . json_encode($dados));
            if (empty($dados)) return $this->respond(['success' => false, 'message' => 'Nenhum dado recebido'], 400);

            $erro = $this->validarDados($dados, $id);
            if ($erro) return $this->respond(['success' => false, 'message' => $erro], 400);

            $dadosUpdate = $this->prepararDados($dados, $pre, $id);
            $this->contribuinteModel->updateComposite((int)$pre, (int)$id, $dadosUpdate);

            $contribuinte_nome = $dadosUpdate['CON_Nome'] ?? null;

            $db = \Config\Database::connect();

            // 🔹 Atualizar atividades (pivot)
            $atividades = $dados['atividades'] ?? [];
            $db->table('atividades_contribuintes')->where('CON_PRE_Codigo', $pre)->where('CON_Codigo', $id)->delete();

DELETE FROM `cnaes_contribuintes`
WHERE `CON_PRE_Codigo` = 1
AND `CON_Codigo` = '1145'
---

            // 🔹 Atualizar CNAEs (pivot)
            $cnaes = $dados['cnaes'] ?? [];
            $db->table('cnaes_contribuintes')->where('CON_PRE_Codigo', $pre)->where('CON_Codigo', $id)->delete();

SELECT *
FROM `cnaes`
WHERE `CNAE_Numero` = '36576344'
 LIMIT 1
---
                $cnaeNumero = $cnae['numero'] ?? $cnae['codigo'] ?? null;
                if (!$cnaeNumero) continue; // Pular se não tiver número

                $cnaeExistente = $this->cnaeModel->where('CNAE_Numero', $cnaeNumero)->first();

INSERT INTO `cnaes_contribuintes` (`CON_PRE_Codigo`, `CON_Codigo`, `CNAE_Codigo`) VALUES (1, '1145', '1')
---
                    ], true);
                }

                $db->table('cnaes_contribuintes')->insert([
                    'CON_PRE_Codigo' => $pre,
                    'CON_Codigo'     => $id,
                    'CNAE_Codigo'    => $cnae_id,
                ]);

SELECT *
FROM `atividades`
---
    public function getAtividades()
    {
        try {
            $atividades = $this->atividadeModel->findAll();

SELECT *
FROM `cnaes`
---
    public function cnaes()
    {
        try {
            $cnaes = $this->cnaeModel->findAll();

SELECT *
FROM `contribuintes`
WHERE `CON_CPFCNPJ` = '13375656602'
AND `CON_PRE_Codigo` = 1
AND `CON_Codigo` != '1145'
 LIMIT 1
---
    private function validarDados($dados, $id = null)
    {
        $camposObrigatorios = ['cpf_cnpj', 'razao_social', 'endereco', 'bairro', 'cidade'];

        foreach ($camposObrigatorios as $campo) {
            if (empty($dados[$campo])) return "O campo {$campo} é obrigatório";
        }

    $cpf_cnpj = preg_replace('/\D/', '', $dados['cpf_cnpj']);

        if (strlen($cpf_cnpj) === 11 && !$this->validarCpf($cpf_cnpj)) return 'CPF inválido';
        if (strlen($cpf_cnpj) === 14 && !$this->validarCnpj($cpf_cnpj)) return 'CNPJ inválido';
        if (!in_array(strlen($cpf_cnpj), [11, 14])) return 'CPF/CNPJ inválido';

    // Verifica se já existe CPF/CNPJ para a mesma prefeitura
    $pre = $this->getPrefeituraCodigo();
    $query = $this->contribuinteModel->where('CON_CPFCNPJ', $cpf_cnpj)->where('CON_PRE_Codigo', $pre);
    if ($id) $query->where('CON_Codigo !=', $id);
    if ($query->first()) return 'CPF/CNPJ já cadastrado em outro contribuinte';