app/Models/AuthTokenModel.php

    public function revokeByUser($userId, $type = null)
    {
        $builder = $this->db->table($this->table)->where('usuario_id', $userId);
        if ($type) $builder->where('type', $type);
        return $builder->delete();
---
DELETE FROM `auth_tokens`
WHERE `usuario_id` = '1'
AND `type` = 'remember'