app/Models/ContribuinteModel.php

SELECT *
FROM `contribuintes`
WHERE `CON_PRE_Codigo` = 1
AND `CON_Codigo` = 1145
 LIMIT 1
---
    public function findByComposite(int $preCodigo, int $conCodigo)
    {
        return $this->where('CON_PRE_Codigo', $preCodigo)
                    ->where('CON_Codigo', $conCodigo)
                    ->first();

UPDATE `contribuintes` SET `CON_PRE_Codigo` = 1, `CON_Codigo` = 1145, `CON_CPFCNPJ` = '13375656602', `CON_Nome` = 'PEDRO LUCAS DA SILVA SANTOS', `CON_Endereco` = 'JOSE CAMILO FIALHO', `CON_TipoPessoa` = 'juridica', `CON_TipoPessoaPJ` = 'outros', `CON_Numero` = 64, `CON_Complemento` = 'CASA 02', `CON_Bairro` = 'SILVESTRE', `CON_Cidade` = 'VIÇOSA', `CON_CEP` = '36576344', `CON_Estado` = '', `CON_Telefone1` = '32913123332', `CON_Telefone2` = '32323131233', `CON_Email` = 'pedrofutebol1@hotmail.com', `CON_InscricaoMunicipal` = '381154916', `CON_InscricaoMunicipalAno` = NULL
WHERE `CON_PRE_Codigo` = 1
AND `CON_Codigo` = 1145
---
    public function updateComposite(int $preCodigo, int $conCodigo, array $data)
    {
        $this->where('CON_PRE_Codigo', $preCodigo)
             ->where('CON_Codigo', $conCodigo);

        return $this->set($data)->update();