app/Models/LoginAttemptModel.php

    public function record($login, $ip, $success)
    {
        $this->insert([
            'username_or_email' => $login,
            'ip' => $ip,
            'success' => $success ? 1 : 0,
            'created_at' => date('Y-m-d H:i:s')
        ]);
---
INSERT INTO `login_attempts` (`username_or_email`, `ip`, `success`, `created_at`) VALUES ('admin', '::1', 1, '2026-01-05 17:31:25')

    public function recentFailures($loginOrIp, $minutes = 15)
    {
        $since = date('Y-m-d H:i:s', strtotime("-{$minutes} minutes"));
        return $this->where("(username_or_email = '{$loginOrIp}' OR ip = '{$loginOrIp}')")
                    ->where('success', 0)
                    ->where('created_at >=', $since)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `login_attempts`
WHERE (`username_or_email` = 'admin' OR `ip` = 'admin')
AND `success` = 0
AND `created_at` >= '2026-01-05 17:30:24'