app/Models/UsuarioModel.php

    public function updateLastLogin($id)
    {
        return $this->update($id, ['last_login_at' => date('Y-m-d H:i:s')]);
---
UPDATE `usuarios` SET `last_login_at` = '2026-01-05 17:31:25', `updated_at` = '2026-01-05 17:31:25'
WHERE `usuarios`.`id` IN ('1')